Revit 2027 API
TableSectionData.CanRemoveRow Method
 Verifies that if the row at the given index can be removed..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanRemoveRow(
	int nIndex
)
Public Function CanRemoveRow (
	nIndex As Integer
) As Boolean
public:
bool CanRemoveRow(
	int nIndex
)
member CanRemoveRow :
        nIndex : int -> bool
Parameters
nIndex Int32
 An integer index.
Return Value
Boolean
 True if the row can be removed, false otherwise
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace